In [1]:
##pandas

#SERIES

In [2]:
import numpy as np
import pandas as pd

In [3]:
##creating a series

labels = ["a", "b", "c"]
my_list = [10,20,30]
arr = np.array([10,20,30])
dict = {"a":10,"b":20,"c":30}

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
arr

array([10, 20, 30])

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [12]:
series1 = pd.Series([1,2,3,4], index = ["Nigeria", "South Africa", "Ghana", "Rwanda"])
series1

Nigeria         1
South Africa    2
Ghana           3
Rwanda          4
dtype: int64

In [13]:
series1["Ghana"]

3

In [14]:
series2 = pd.Series([1,2,3,4], index = ["Nigeria", "South Africa", "Liberia", "Rwanda"])
series2

Nigeria         1
South Africa    2
Liberia         3
Rwanda          4
dtype: int64

In [15]:
series1 + series2

Ghana           NaN
Liberia         NaN
Nigeria         2.0
Rwanda          8.0
South Africa    4.0
dtype: float64

#DATAFRAMES

In [16]:
import sys
print(sys.getrecursionlimit())

3000

In [17]:
sys.setrecursionlimit(10000)

In [18]:
from numpy.random import randn
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4), index = "A B C D E".split(),columns = "w x y z".split())
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df["w"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [21]:
df[["x","y"]]

          x         y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [22]:
#adding a new column
# df = df["new"] = df["x"] + df["y"]
# df

In [23]:
#adding a column at a particular index using the insert method
# df.insert(2,"new_column2",df["X"]*df["Y"])
# df

In [24]:
# df.assign(new_column3 = df["X"]/df["Y"],new_column4 = df["X"]//df["Y"])

In [25]:
data = {
    "Name":["chiamaka", "gbemi", "aminu", "lubabat"],
    "Age": [10,20,30,40],
    "Nationality": ["nigeria", "ghana", "rwanda", "togo"],
    "Gender": ["male","female","male","female" ]
}

data

{'Name': ['chiamaka', 'gbemi', 'aminu', 'lubabat'],
 'Age': [10, 20, 30, 40],
 'Nationality': ['nigeria', 'ghana', 'rwanda', 'togo'],
 'Gender': ['male', 'female', 'male', 'female']}

In [26]:
data1 = pd.DataFrame(data, index=["A","B","C","D"])
data1

       Name  Age Nationality  Gender
A  chiamaka   10     nigeria    male
B     gbemi   20       ghana  female
C     aminu   30      rwanda    male
D   lubabat   40        togo  female

In [27]:
##removing a column
##axis = 1 === columns
##axis = 0 == rows

In [28]:
data1.drop("Age",axis=1)

       Name Nationality  Gender
A  chiamaka     nigeria    male
B     gbemi       ghana  female
C     aminu      rwanda    male
D   lubabat        togo  female

In [29]:
data1

       Name  Age Nationality  Gender
A  chiamaka   10     nigeria    male
B     gbemi   20       ghana  female
C     aminu   30      rwanda    male
D   lubabat   40        togo  female

In [30]:
data1.drop("Age", axis=1, inplace= True)

In [31]:
data1

       Name Nationality  Gender
A  chiamaka     nigeria    male
B     gbemi       ghana  female
C     aminu      rwanda    male
D   lubabat        togo  female

In [33]:
##removing a row
data1.drop("C", axis=0)

       Name Nationality  Gender
A  chiamaka     nigeria    male
B     gbemi       ghana  female
D   lubabat        togo  female

In [34]:
data1

       Name Nationality  Gender
A  chiamaka     nigeria    male
B     gbemi       ghana  female
C     aminu      rwanda    male
D   lubabat        togo  female

In [ ]:
##selecting rows
#1. loc = location
#2. iloc = index location

In [35]:
data1.loc["A"]

Name           chiamaka
Nationality     nigeria
Gender             male
Name: A, dtype: object

In [36]:
data1.iloc[3]

Name           lubabat
Nationality       togo
Gender          female
Name: D, dtype: object

In [38]:
data1.iloc[2,2]   #[ROW,COLUMN]

'male'

In [39]:
data1

       Name Nationality  Gender
A  chiamaka     nigeria    male
B     gbemi       ghana  female
C     aminu      rwanda    male
D   lubabat        togo  female

##CONDITIONAL SELECTION

In [41]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df > 0

       w      x      y      z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [43]:
df[df > 0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df["w"]>0

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [45]:
df[df["w"]>0]  ##selects only the rows that are true

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509